money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов
month = 0
while money_capital >= 0:
    difference = spend - salary
    money_capital = money_capital - difference
    if money_capital < 0:
        break
    month += 1
    spend += (spend * increase)

    # print(spend, difference, money_capital, month)

print("Количество месяцев, которое можно протянуть без долгов:", month)


# Каждый месяц у нас есть ЗП и траты. Траты увеличиваются на 5% каждый месяц. Так же, есть подушка безопасности.
# Как посчитать скок протяну без долгов?
# Цикл. Что в нем должно быть? Счет месяцев. Условие остаток. Пока, остаток не меньше нуля, считать в цикле. Но подушка безопасности у нас конечная.
# Покрываем разницу подушкой. Как? Считаем, сколько нам не хватает с ЗП. Из подушки каждый раз минусуем разницу
# В первый месяц роста нет. Что делать? Использовать в конце цикла? Возможно, сработало
# Деньги уходят в минус на 9 месяце. Что делать? Добавить проверку на меньше нуля. Что делать в этой проверке? Откатывать цикл назад. (не сработало, логика не верная)
# нашел break, теперь, вроде, норм.., по крайней мере, ответ сошелся =-=